package com.hanul.array2;

public class Class_1 {

	public static void main(String[] args) {
		// 변수 -> 배열 -> 구조체 -> 복합(Class)
		// 배열의 단점, 같은 타입만 묶을 수 있다는 단점을 보완해주는 더 큰 단위의 묶음이
		// 구조체이고 이 구조체의 주소를 나타내는 것이 바로 Class이다.
		// 일종의 설계도를 Class라고 하기도 함.
		// 어떠한 제품(객체)을 만들기 위해, 어떠한 부품(객체)들이 필요한가를 나타내는 것이 Class
		// Class 내에 무엇이 들어가는가? = 정의된 객체
		// 정의된 객체에는 무엇이 있는가? = {속성||(멤버)변수} && {기능||(멤버)메서드}
		// 멤버변수 내지는 속성이란 그 제품(객체)이 어떤 특징들을 가지고 있는가.
		// 기능 내지는 메서드란 그 제품(객체)이 어떤 기능(act)을 수행하는가.
		// eg. tv class 
		// tv의 멤버변수 - 색깔, 크기, 채널 수, 볼륨 등등
		// tv의 메서드 - 채널 돌리기, 볼륨 조정, 전원켜기 끄기 등등
		
		// 변수만 있는 class , 메서드만 있는  class, 둘 다 있거나 없거나 등의 class의 종류는 다양.
		// 객체 생성 - 변수 선언과 유사함. 클래스도 하나의 데이터타입으로 본다면 유사함.
		// 클래스명 변수명 = new 클래스명();
		
		// instance 와 object
		// instance란 Class내에 정의된 object를 말함.
		// 따라서 instance란 말을 사용할 경우, ~~class의 instance다.
		
		// 제어문과 같은 ~~문은 메서드 내부에 존재해야만 기능을 한다.
		
		
		
	}
	
}
